---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.StairsRunType
source: html/ca6f30a3-e07e-8d26-2a38-734bb05a2efa.htm
---
# StairsRunType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.